# Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме:
# название, форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
# Если фирма получила убытки, в расчет средней прибыли ее не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями,
# а также словарь со средней прибылью. Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
#
# Подсказка: использовать менеджеры контекста.

import json

with open('task7.json', 'w') as wt7:
    with open('task7.txt', 'r') as f:
        list_firm =[]
        profit_firm = {line.split()[0]: (int(line.split()[2]) - int(line.split()[3])) for line in f}
        list_firm.append(profit_firm)
        avarage_profit = {'Mid profit': (sum(profit_firm.values()) / len(profit_firm.values()))}
        list_firm.append(avarage_profit)
        print(list_firm)
    json.dump(list_firm, wt7, indent='   ')